opends/tests/functional-tests/shared/data/dsml/suites/08miscsuite/data/060_bind_1.dat

POST /dsml HTTP/1.1
Host: Foo
Authorization: Basic %VALIDAUTH%
Connection: Close
Content-Length: 1159
SOAPAction: "#batchRequest"

<?xml version='1.0' encoding='UTF-8'?>
  <soap-env:Envelope
      xmlns:xsd='http://www.w3.org/2001/XMLSchema'
      xmlns:xsi='http://www.w3.org/2001/XMLSchema-instance'
      xmlns:soap-env='http://schemas.xmlsoap.org/soap/envelope/'>
    <soap-env:Body>
      <batchRequest xmlns="urn:oasis:names:tc:DSML:2:0:core">
		
        <modifyRequest dn="o=IMC, c=US">
          <modification name="aci" operation="replace">
               <value>(targetattr = "*") (version 3.0;acl "All";allow (read,compare,search)(userdn = "ldap:///anyone");)</value>
          </modification>
        </modifyRequest>
	
        <searchRequest dn="o=IMC, c=US" scope="wholeSubtree" derefAliases="neverDerefAliases">
          <filter>
               <equalityMatch name="uid">
	       <value>Paul Cezanne</value>
	       </equalityMatch>
          </filter>
        </searchRequest>
	
        <modifyRequest dn="cn=paul cezanne,ou=americas,ou=search,o=imc,c=us">
          <modification name="givenname" operation="replace">
               <value>Paule</value>
          </modification>
        </modifyRequest>

      </batchRequest>
    </soap-env:Body>
  </soap-env:Envelope>
